#include <iostream>

#include "console.h"
#include "taskManager.h"
#include "vector.h"

// Створити тип даних - клас VectorInt(вектор цілих чисел), який має вказівник на int,
// число елементів size і змінну стану codeError.У класі визначити
// - конструктор без параметрів(виділяє місце для одного елемента та інінціалізує його в нуль);
// - конструктор з одним параметром - розмір вектора(виділяє місце та інінціалізує масив значенням нуль);
// - конструктор із двома параметрами - розмір вектора та значення ініціалізації(виділяє місце(значення перший аргумент) та інінціалізує значенням другого аргументу);
// - конструктор копіювання;
// - деструктор звільняє пам'ять; o перевантаження операцій(операції перевантажувати через функції класу або дружні функції, якщо не вказано яким чином це робити) : void task_01() унарних префіксних та постфіксних ++ та --: одночасно збільшує (зменшує) значення елементів масиву на 1;
// - унарної логічної !(заперечення) : повертає значення true, якщо елем нти якщо size не дорівнює – нулю, інакше false;
// - унарної побітової ~(заперечення) : повертає побітове заперечення для всіх елементів масиву класу вектор;
// - унарний арифметичний - (мінус) : повертає всі елементи масиву класу вектор з протилежним знаком;
// - присвоєння = : копіює вектор(перевантажити через функцію класу);
// - присвоєння з(перевантажити через функцію класу)
// -  += -додаванням векторів;
// - -= -відніманням векторів;
// - *= -множення, вектора на число типу int;
// - /= -ділення, вектора на число типу int;
// - %= -остача від ділення, вектора на число типу int;
// - |= -побітове додаванням векторів;
// - ^= -побітове додавання за модулем 2 векторів;
// - &= -побітове по - елементне множення векторів;
// - арифметичних бінарні : o + -додавання векторів;
// - – - віднімання векторів;
// - * -множення, вектора на число типу int;
// - / -ділення, вектора на число типу int;
// - % -остача від ділення, вектора на число типу int;
// - побітові бінарні
// - | -побітове додавання векторів;
// - ^ -побітове додавання за модулем 2 векторів;
// - & -побітове по - елементне множення векторів;
// - побітові операції зсувів, як дружні операції введення та виведення вектора у потік(перевантажувати через дружні функції)
// - введення >> (побітовий зсув право);
// - введення << (побітовий зсув ліво);
// - рівності == та нерівності !=, функція - операція виконує певні дії над кожною парою елементів векторів за індексом;
// - операцію індексації[] – функцію, яка звертається до елементу масиву за індексом, якщо індекс невірний функція вказує на останній елемент масиву та встановлює код помилки у змінну codeError;
// - розподілу пам’яті new та delete;
// - виклику функції();
// - порівняння(функція - операція виконує певні дії над кожною парою елементів векторів за індексом), які повертають true або false : o > (більше)для двох векторів;
// - >= (більше рівне)для двох векторів;
// - < (менше)для двох векторів;
// -  <= (менше рівне)для двох векторів.

// У змінну стани встановлювати код помилки, коли не вистачає пам'яті, виходить за межі масиву. Передбачити можливість підрахунку числа об'єктів даного типу. Перевірити роботу цього класу.
void task_01()
{
	VectorInt v1;
	v1.print();

	VectorInt v2(5);
	v2.print();

	VectorInt v3(5, 2);
	v3.print();

	VectorInt v4(v3);
	v4.print();

	++v4;
	v4.print();

	v4++;
	v4.print();

	--v4;
	v4.print();
}
