#include <iostream>

#include "console.h"
#include "taskManager.h"
#include "class/map.h"

// Побудувати асоційований клас збереження
// двох сутностей.В завданні створити клас,
// який представляє собою асоціативний
// масив між двома сутностями.Написати функцію створення набору
// асоціативних сутностей.Перевантажити операцію індексації[] – функцію,
// яка звертається до об’єкта класу,
// за однією сутністю, якщо індекс, повертає асоціативну сутність, якщо відповідної сутності немає в встановлює код помилки у змінну CodeError, альтернативні звернення через перевантаження операції виклику функції();
// перевантажити дружні операції введення та
// виведення.
// Задача 2.1. Цілих чисел від 1 до 100 та цілі прописом.Наприклад, 1 та один, 10 та десять.

using namespace std;

void task_02()
{
	// Map<int, string> map;

	// map.add();
}